package com.alw.temca.Function

    fun FindDetailInstallation(typcable:String):String{
        val result:String = when(typcable){
            "กลุ่ม 1" -> "กลุ่ม 1 (เดินสายภายในฝ้าเพดานที่เป็นฉนวนความร้อน)"
            "กลุ่ม 2" -> "กลุ่ม 2 (เดินเกาะผนัง,เพดาน,ฝังคอนกรีต)"
            "กลุ่ม 3" -> "กลุ่ม 3 (เดินเกาะผนังไม่มีสิ่งปิดหุ้ม)"
            "กลุ่ม 4" -> "กลุ่ม 4 (สายแกนเดี่ยวเดินบนฉนวนลูกถ้วย)"
            "กลุ่ม 5" -> "กลุ่ม 5 (เดินในท่อฝังดิน)"
            "กลุ่ม 6" -> "กลุ่ม 6 (เดินฝังดินโดยตรง)"
            "กลุ่ม 7" -> "กลุ่ม 7 (เดินในรางเคเบิล)"
            else -> "-"
        }
        return result
    }


